In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
df['col2'].nunique()

3

In [8]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [10]:
x=df[(df['col1']>2) & (df['col2']==444)]

In [12]:
x

   col1  col2 col3
3     4   444  xyz

In [14]:
def x2(x):
    return x*2

In [16]:
df['col1'].apply(x2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [20]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [22]:
df['col1'].sum()

10

In [24]:
del df['col1']

In [26]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [28]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [30]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [36]:
df.dropna() #deleta valores nan por linha

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz